import { Link } from 'react-router';
import Btn from '../UI/Btn';

const WhyUs = () => {
  return (
    <section className='relative w-full py-5 bg-black/90 flex justify-center items-center'>
      <article className='w-full max-w-4xl px-4'>
        <h1 className='text-[34px] italic text-white font-bold text-center'>
          Чому варто обрати саме нас для знайомств?
        </h1>
        <p className='text-white/80 my-7 text-lg'>
          Коли ти студент, знайомства мають особливий сенс: нові друзі в
          гуртожитку, компанія для навчання чи поїздки, а може навіть — історія
          кохання, яку ти запам’ятаєш на все життя. Тут тобі не потрібно
          губитися серед тисяч людей з усього світу — наша спільнота створена
          саме для студентів України. Ми знаємо, чого ти шукаєш: спілкування,
          легких зустрічей, підтримки й нових емоцій.
        </p>
        <p className='text-white/80 text-lg pb-7'>
          Ми не будемо переконувати, що ми "найкращий сайт". Ми просто дамо тобі
          можливість спробувати, познайомитися і самому вирішити, наскільки тобі
          тут комфортно. Наші функції допомагають легко знаходити людей зі
          схожими інтересами у твоєму місті, університеті чи навіть на твоєму
          факультеті. Це знайомства, які справді можуть змінити твоє студентське
          життя.
        </p>

        <Link to='/' className='w-58 block mx-auto'>
          <Btn>Приєднатися зараз</Btn>
        </Link>
      </article>
    </section>
  );
};

export default WhyUs;
